arzh_loadTest/get_consistent.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 2.207ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.194ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.09ms  771.94us   5.01ms   65.90%
    Req/Sec   105.11    110.18   333.00     79.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.12ms
 75.000%    2.62ms
 90.000%    3.09ms
 99.000%    3.85ms
 99.900%    4.33ms
 99.990%    5.01ms
 99.999%    5.01ms
100.000%    5.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.311     0.000000            2         1.00
       1.062     0.100000          390         1.11
       1.375     0.200000          780         1.25
       1.645     0.300000         1170         1.43
       1.891     0.400000         1560         1.67
       2.125     0.500000         1954         2.00
       2.221     0.550000         2145         2.22
       2.327     0.600000         2341         2.50
       2.421     0.650000         2536         2.86
       2.519     0.700000         2732         3.33
       2.623     0.750000         2926         4.00
       2.687     0.775000         3023         4.44
       2.745     0.800000         3120         5.00
       2.819     0.825000         3220         5.71
       2.891     0.850000         3315         6.67
       2.989     0.875000         3414         8.00
       3.035     0.887500         3462         8.89
       3.085     0.900000         3510        10.00
       3.153     0.912500         3559        11.43
       3.223     0.925000         3610        13.33
       3.299     0.937500         3659        16.00
       3.333     0.943750         3683        17.78
       3.369     0.950000         3705        20.00
       3.417     0.956250         3730        22.86
       3.453     0.962500         3754        26.67
       3.503     0.968750         3779        32.00
       3.563     0.971875         3791        35.56
       3.605     0.975000         3803        40.00
       3.661     0.978125         3815        45.71
       3.703     0.981250         3827        53.33
       3.755     0.984375         3840        64.00
       3.781     0.985938         3847        71.11
       3.801     0.987500         3852        80.00
       3.837     0.989062         3858        91.43
       3.879     0.990625         3864       106.67
       3.933     0.992188         3870       128.00
       3.949     0.992969         3873       142.22
       3.971     0.993750         3876       160.00
       3.997     0.994531         3879       182.86
       4.023     0.995313         3882       213.33
       4.043     0.996094         3885       256.00
       4.085     0.996484         3888       284.44
       4.085     0.996875         3888       320.00
       4.135     0.997266         3890       365.71
       4.163     0.997656         3892       426.67
       4.199     0.998047         3893       512.00
       4.231     0.998242         3894       568.89
       4.231     0.998437         3894       640.00
       4.291     0.998633         3895       731.43
       4.331     0.998828         3896       853.33
       4.387     0.999023         3897      1024.00
       4.387     0.999121         3897      1137.78
       4.387     0.999219         3897      1280.00
       4.431     0.999316         3898      1462.86
       4.431     0.999414         3898      1706.67
       4.695     0.999512         3899      2048.00
       4.695     0.999561         3899      2275.56
       4.695     0.999609         3899      2560.00
       4.695     0.999658         3899      2925.71
       4.695     0.999707         3899      3413.33
       5.015     0.999756         3900      4096.00
       5.015     1.000000         3900          inf
#[Mean    =        2.093, StdDeviation   =        0.772]
#[Max     =        5.012, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 556.83KB read
Requests/sec:    200.04
Transfer/sec:     18.56KB