arzh_loadTest/get_grpc_ack_2.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 2.238ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.030ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.06ms  476.78us   6.28ms   69.28%
    Req/Sec   104.83    108.56   333.00     78.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.05ms
 75.000%    2.37ms
 90.000%    2.67ms
 99.000%    3.18ms
 99.900%    5.04ms
 99.990%    6.28ms
 99.999%    6.28ms
100.000%    6.28ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.936     0.000000            1         1.00
       1.478     0.100000          393         1.11
       1.648     0.200000          781         1.25
       1.787     0.300000         1171         1.43
       1.914     0.400000         1563         1.67
       2.051     0.500000         1953         2.00
       2.119     0.550000         2152         2.22
       2.179     0.600000         2342         2.50
       2.237     0.650000         2536         2.86
       2.293     0.700000         2733         3.33
       2.373     0.750000         2928         4.00
       2.411     0.775000         3030         4.44
       2.455     0.800000         3124         5.00
       2.499     0.825000         3220         5.71
       2.547     0.850000         3317         6.67
       2.601     0.875000         3419         8.00
       2.633     0.887500         3462         8.89
       2.667     0.900000         3511        10.00
       2.707     0.912500         3559        11.43
       2.741     0.925000         3609        13.33
       2.785     0.937500         3657        16.00
       2.801     0.943750         3681        17.78
       2.833     0.950000         3705        20.00
       2.863     0.956250         3731        22.86
       2.893     0.962500         3754        26.67
       2.939     0.968750         3779        32.00
       2.967     0.971875         3791        35.56
       2.997     0.975000         3803        40.00
       3.023     0.978125         3815        45.71
       3.045     0.981250         3828        53.33
       3.093     0.984375         3840        64.00
       3.125     0.985938         3846        71.11
       3.163     0.987500         3853        80.00
       3.173     0.989062         3858        91.43
       3.201     0.990625         3864       106.67
       3.263     0.992188         3870       128.00
       3.275     0.992969         3873       142.22
       3.281     0.993750         3876       160.00
       3.323     0.994531         3879       182.86
       3.359     0.995313         3882       213.33
       3.377     0.996094         3885       256.00
       3.395     0.996484         3887       284.44
       3.397     0.996875         3888       320.00
       3.417     0.997266         3890       365.71
       3.421     0.997656         3891       426.67
       4.035     0.998047         3893       512.00
       4.163     0.998242         3894       568.89
       4.163     0.998437         3894       640.00
       4.207     0.998633         3895       731.43
       5.039     0.998828         3896       853.33
       5.247     0.999023         3897      1024.00
       5.247     0.999121         3897      1137.78
       5.247     0.999219         3897      1280.00
       5.811     0.999316         3898      1462.86
       5.811     0.999414         3898      1706.67
       5.823     0.999512         3899      2048.00
       5.823     0.999561         3899      2275.56
       5.823     0.999609         3899      2560.00
       5.823     0.999658         3899      2925.71
       5.823     0.999707         3899      3413.33
       6.283     0.999756         3900      4096.00
       6.283     1.000000         3900          inf
#[Mean    =        2.064, StdDeviation   =        0.477]
#[Max     =        6.280, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 556.83KB read
Requests/sec:    200.05
Transfer/sec:     18.56KB