arzh_loadTest/get_rendezvous.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 5.900ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.802ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.15ms  842.83us   6.43ms   65.79%
    Req/Sec   104.94    109.96   333.00     80.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.12ms
 75.000%    2.74ms
 90.000%    3.23ms
 99.000%    4.16ms
 99.900%    4.74ms
 99.990%    6.43ms
 99.999%    6.43ms
100.000%    6.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.316     0.000000            1         1.00
       1.048     0.100000          391         1.11
       1.342     0.200000          780         1.25
       1.634     0.300000         1170         1.43
       1.877     0.400000         1562         1.67
       2.121     0.500000         1951         2.00
       2.255     0.550000         2146         2.22
       2.385     0.600000         2343         2.50
       2.495     0.650000         2536         2.86
       2.613     0.700000         2732         3.33
       2.739     0.750000         2927         4.00
       2.803     0.775000         3024         4.44
       2.867     0.800000         3123         5.00
       2.939     0.825000         3218         5.71
       3.015     0.850000         3316         6.67
       3.121     0.875000         3413         8.00
       3.177     0.887500         3462         8.89
       3.231     0.900000         3511        10.00
       3.309     0.912500         3560        11.43
       3.383     0.925000         3610        13.33
       3.469     0.937500         3659        16.00
       3.505     0.943750         3682        17.78
       3.567     0.950000         3706        20.00
       3.617     0.956250         3731        22.86
       3.717     0.962500         3756        26.67
       3.777     0.968750         3779        32.00
       3.829     0.971875         3793        35.56
       3.877     0.975000         3803        40.00
       3.923     0.978125         3815        45.71
       3.987     0.981250         3827        53.33
       4.041     0.984375         3841        64.00
       4.077     0.985938         3846        71.11
       4.099     0.987500         3852        80.00
       4.143     0.989062         3858        91.43
       4.163     0.990625         3865       106.67
       4.207     0.992188         3870       128.00
       4.219     0.992969         3873       142.22
       4.287     0.993750         3876       160.00
       4.315     0.994531         3879       182.86
       4.339     0.995313         3882       213.33
       4.387     0.996094         3885       256.00
       4.443     0.996484         3887       284.44
       4.471     0.996875         3888       320.00
       4.555     0.997266         3890       365.71
       4.579     0.997656         3891       426.67
       4.679     0.998047         3893       512.00
       4.699     0.998242         3894       568.89
       4.699     0.998437         3894       640.00
       4.735     0.998633         3895       731.43
       4.743     0.998828         3896       853.33
       4.791     0.999023         3897      1024.00
       4.791     0.999121         3897      1137.78
       4.791     0.999219         3897      1280.00
       4.819     0.999316         3898      1462.86
       4.819     0.999414         3898      1706.67
       4.823     0.999512         3899      2048.00
       4.823     0.999561         3899      2275.56
       4.823     0.999609         3899      2560.00
       4.823     0.999658         3899      2925.71
       4.823     0.999707         3899      3413.33
       6.435     0.999756         3900      4096.00
       6.435     1.000000         3900          inf
#[Mean    =        2.145, StdDeviation   =        0.843]
#[Max     =        6.432, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 556.83KB read
Requests/sec:    200.05
Transfer/sec:     18.56KB